{"api_description_list": ["android net Connectivity Manager get Network Capabilities Get the network capabilities for the given Network, or null. This will remove any location sensitive data in the returned NetworkCapabilities.", "android net Connectivity Manager get Network Info Returns connection status information about a particular network type.", "android net wifi Wifi Manager get Connection Info Return dynamic information about the current Wi-Fi connection, if any is active.", "android net Connectivity Manager get Link Properties Get the link properties for the given Network. This will return null if the network is unknown.", "android net Connectivity Manager get All Networks Returns an array of all Network currently tracked by the framework.", "android telephony Telephony Manager get Sim State Returns a constant indicating the state of the default Subscriber Identity Module card.", "android telephony Telephony Manager get Network Operator Returns the numeric name (mobile country code and mobile network code) of current registered operator.", "android net Connectivity Manager get Active Network Info Returns details about the currently active default data network. When connected, this network is the default route for outgoing connections.", "android telephony Telephony Manager get Sim Operator Returns the mobile country code and mobile network code of the provider of the Subscriber Identity Module. 5 or 6 decimal digits.", "android net Connectivity Manager get Active Network Returns a Network object corresponding to the currently active default data network. In the event that the current active default data network disconnects, the returned Network object will no longer be usable. This will return null when there is no default network, or when the default network is blocked.", "android net wifi Wifi Manager get Scan Results Return the results of the latest access point scan."], "api_name_list": ["android.net.ConnectivityManager.getNetworkCapabilities", "android.net.ConnectivityManager.getNetworkInfo", "android.net.wifi.WifiManager.getConnectionInfo", "android.net.ConnectivityManager.getLinkProperties", "android.net.ConnectivityManager.getAllNetworks", "android.telephony.TelephonyManager.getSimState", "android.telephony.TelephonyManager.getNetworkOperator", "android.net.ConnectivityManager.getActiveNetworkInfo", "android.telephony.TelephonyManager.getSimOperator", "android.net.ConnectivityManager.getActiveNetwork", "android.net.wifi.WifiManager.getScanResults"]}